Revit 2027 API
BasicFileInfo.Format Property
 The file format indicator (currently, the major release version such as "2019") used for saving the file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Format { get; }
Public ReadOnly Property Format As String
	Get
public:
property String^ Format {
	String^ get ();
}
member Format : string with get
Property Value
String
See Also
Reference
BasicFileInfo Class
Autodesk.Revit.DB Namespace